# ============================================================
# МОДУЛЬ 9: Срезы и методы списков
# ============================================================
# Уровень: ★★☆
# Темы: срезы [start:stop:step], append, extend, insert,
#        remove, pop, clear, sort, reverse, copy, count, index
# ============================================================
# --- Задача 1 ---
# Дан список a = [10, 20, 30, 40, 50, 60, 70].
# Выведи: первые 3 элемента, последние 2, каждый второй, в обратном порядке.
# Твой код:





a = [10, 20, 30, 40, 50, 60, 70]
print(a[:3])
print(a[-2:])
print(a[::2])
print(a[::-1])

# --- Задача 2 ---
# Используя срез, получи среднюю часть списка (без первого и последнего).
# a = [1, 2, 3, 4, 5, 6, 7]  →  [2, 3, 4, 5, 6]
# Твой код:





a = [1, 2, 3, 4, 5, 6, 7]
print(a[1:-1])

# --- Задача 3 ---
# s = [5, 9, 3, 7, 1, 8]. Добавь 99 в конец (append),
# затем [10, 20] в конец (extend), затем 100 на позицию 2 (insert).
# Выведи список после каждого шага.
# Твой код:





s = [5, 9, 3, 7, 1, 8]
s.append(99)
print(s)
s.extend([10, 20])
print(s)
s.insert(2, 100)
print(s)

# --- Задача 4 ---
# s = [5, 9, 3, 7, 1, 8, 3, 9].
# Удали элемент по значению 3 (remove) — удалит первый.
# Удали элемент по индексу 2 (pop). Выведи, что вернул pop.
# Твой код:





s = [5, 9, 3, 7, 1, 8, 3, 9]
s.remove(3)
print(s)
popped = s.pop(2)
print("pop ->", popped)
print(s)

# --- Задача 5 ---
# Отсортируй список по возрастанию (sort) и по убыванию (sort(reverse=True)).
# s = [5, 2, 8, 1, 9, 3, 7]
# Твой код:





s = [5, 2, 8, 1, 9, 3, 7]
s.sort()
print(s)
s.sort(reverse=True)
print(s)

# --- Задача 6 ---
# Отсортируй список имён по длине слова (sort(key=len)).
# names = ["Дима", "Настя", "Маша", "Яна", "Амин", "Вася"]
# Твой код:





names = ["Дима", "Настя", "Маша", "Яна", "Амин", "Вася"]
names.sort(key=len)
print(names)

# --- Задача 7 ---
# Покажи разницу между sort() и sorted():
# a = [5, 3, 1, 4, 2]
# b = sorted(a)
# a.sort()
# Выведи a и b до и после. Что изменилось?
# Твой код:





a = [5, 3, 1, 4, 2]
print("до:", a)
b = sorted(a)
print("sorted ->", b, "a:", a)
a.sort()
print("после a.sort():", a)

# --- Задача 8 ---
# Покажи разницу между copy() и присваиванием:
# a = [1, 2, 3]
# b = a         # ← это НЕ копия!
# c = a.copy()  # ← это копия
# Добавь 99 в a. Проверь b и c — кто изменился?
# Твой код:





a = [1, 2, 3]
b = a
c = a.copy()
a.append(99)
print(b, c)

# --- Задача 9 ---
# Спроси у пользователя n чисел. Собери в список.
# Оставь только кратные 3 (удали остальные через новый список или comprehension).
# Твой код:





n = int(input("Сколько чисел: "))
nums = [int(input()) for _ in range(n)]
nums3 = [x for x in nums if x % 3 == 0]
print(nums3)

# --- Задача 10 ---
# Найди общие элементы двух списков (без set):
# a = [1, 3, 5, 7, 9]
# b = [2, 3, 5, 8, 9, 10]
# Результат: [3, 5, 9]
# Твой код:





a = [1, 3, 5, 7, 9]
b = [2, 3, 5, 8, 9, 10]
common = [x for x in a if x in b]
print(common)

# --- Задача 11 ---
# Переместите максимальный элемент в начало списка.
# x = [4, 7, 2, 9, 1, 5]  →  [9, 4, 7, 2, 1, 5]
# Используй max(), remove(), insert() или index().
# Твой код:





x = [4, 7, 2, 9, 1, 5]
m = max(x)
x.remove(m)
x.insert(0, m)
print(x)

# --- Задача 12 ---
# Удали все вхождения числа 3 из списка:
# a = [1, 3, 5, 3, 7, 3, 9]  →  [1, 5, 7, 9]
# (remove удаляет только первое — нужен цикл или comprehension)
# Твой код:





a = [1, 3, 5, 3, 7, 3, 9]
a = [x for x in a if x != 3]
print(a)
