# ============================================================
# МОДУЛЬ 8: Списки — основы
# ============================================================
# Уровень: ★★☆
# Темы: создание, индексы, len, in, list comprehension,
#        ввод списка, перебор for, изменение элементов
# ============================================================
# --- Задача 1 ---
# Создай список из 5 любых чисел. Выведи первый, последний и длину.
# Твой код:





nums = [3, 7, 1, 9, 5]
print(nums[0], nums[-1], len(nums))

# --- Задача 2 ---
# Создай список colors = ["red", "green", "blue", "yellow"].
# Замени "green" на "orange". Выведи список.
# Твой код:





colors = ["red", "green", "blue", "yellow"]
colors[1] = "orange"
print(colors)

# --- Задача 3 ---
# Создай список через list comprehension: квадраты чисел от 1 до 10.
# [1, 4, 9, 16, 25, 36, 49, 64, 81, 100]
# Твой код:





sq = [i * i for i in range(1, 11)]
print(sq)

# --- Задача 4 ---
# Создай список из n чисел, введённых пользователем.
# Сначала спроси n, потом n раз спроси число.
# Твой код:





n = int(input("n: "))
arr = []
for _ in range(n):
    arr.append(int(input("число: ")))
print(arr)

# --- Задача 5 ---
# Дан список чисел. Найди сумму, минимум и максимум (без min/max/sum).
# Пройдись циклом for.
# nums = [4, -2, 8, 1, -5, 3, 7]
# Твой код:





nums = [4, -2, 8, 1, -5, 3, 7]
s = nums[0]
mn = nums[0]
mx = nums[0]
for x in nums[1:]:
    s += x
    if x < mn:
        mn = x
    if x > mx:
        mx = x
print(s, mn, mx)

# --- Задача 6 ---
# Дан список. Посчитай количество чётных и сумму нечётных элементов.
# nums = list(range(1, 21))
# Твой код:





nums = list(range(1, 21))
evens = 0
odd_sum = 0
for x in nums:
    if x % 2 == 0:
        evens += 1
    else:
        odd_sum += x
print(evens, odd_sum)

# --- Задача 7 ---
# Поменяй местами первый и последний элемент списка.
# a = [10, 20, 30, 40, 50]
# Твой код:





a = [10, 20, 30, 40, 50]
a[0], a[-1] = a[-1], a[0]
print(a)

# --- Задача 8 ---
# Создай список через comprehension: только чётные числа от 1 до 30.
# Твой код:





ev = [i for i in range(1, 31) if i % 2 == 0]
print(ev)

# --- Задача 9 ---
# Проверь, есть ли элемент в списке (используй in / not in).
# fruits = ["apple", "banana", "cherry"]
# Спроси фрукт у пользователя, скажи — есть или нет.
# Твой код:





fruits = ["apple", "banana", "cherry"]
f = input("Фрукт: ").strip().lower()
print("Есть" if f in fruits else "Нет")

# --- Задача 10 ---
# Дан список nums = [3, 1, 4, 1, 5, 9, 2, 6, 5, 3, 5].
# Создай НОВЫЙ список, в котором только уникальные элементы
# (без повторов), сохраняя порядок. Без set()!
# Твой код:





nums = [3, 1, 4, 1, 5, 9, 2, 6, 5, 3, 5]
uniq = []
for x in nums:
    if x not in uniq:
        uniq.append(x)
print(uniq)

# --- Задача 11 ---
# Объедини два списка: a = [1, 2, 3] и b = [4, 5, 6].
# Выведи результат через + и через extend. В чём разница?
# Твой код:





a, b = [1, 2, 3], [4, 5, 6]
print(a + b)
c = a.copy()
c.extend(b)
print(c)
# + создаёт новый список; extend добавляет элементы в существующий

# --- Задача 12 ---
# Сравни == и is для двух одинаковых списков.
# a = [1, 2, 3]
# b = [1, 2, 3]
# c = a
# Выведи: a == b, a is b, a == c, a is c. Объясни результат комментарием.
# Твой код:





a = [1, 2, 3]
b = [1, 2, 3]
c = a
print(a == b, a is b, a == c, a is c)
# == сравнивает содержимое; is сравнивает объекты в памяти
